crossref/scenarios/events_unknown_subscription.request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  <s:Header><!--WSSE--></s:Header>
  <s:Body>
    <tev:PullMessages xmlns:tev="http://www.onvif.org/ver10/events/wsdl">
      <tev:Timeout>PT10S</tev:Timeout>
      <tev:MessageLimit>10</tev:MessageLimit>
      <tev:SubscriptionId>bogus-nonexistent-subscription-id</tev:SubscriptionId>
    </tev:PullMessages>
  </s:Body>
</s:Envelope>
