artifacts/events/pull_debounce_body.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
            xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
            xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
  <s:Header/>
  <s:Body>
    <tev:PullMessages>
      <tev:Timeout>PT3S</tev:Timeout>
      <tev:MessageLimit>50</tev:MessageLimit>
    </tev:PullMessages>
  </s:Body>
</s:Envelope>

