integration_testing/resources/test/onvif/event_service/CreatePullPointSubscription.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:tns1="http://www.onvif.org/ver10/topics" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
	<s:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<wsse:UsernameToken>
				<wsse:Username>admin</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">MK+DSJ2HpfsmDm7IWYvuDDL6xFk=</wsse:Password>
				<wsse:Nonce>MbMbUS0OzwEjCfOhATDvxA==</wsse:Nonce>
				<wsu:Created>2022-03-07T13:19:39Z</wsu:Created>
			</wsse:UsernameToken>
		</wsse:Security>
	</s:Header>
	<s:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
		<CreatePullPointSubscription xmlns="http://www.onvif.org/ver10/events/wsdl">
			<Filter>
				<wsnt:TopicExpression Dialect="http://www.onvif.org/ver10/tev/topicExpression/ConcreteSet">tns1:RuleEngine/CellMotionDetector/Motion</wsnt:TopicExpression>
			</Filter>
			<InitialTerminationTime>PT10S</InitialTerminationTime>
		</CreatePullPointSubscription>
	</s:Body>
</s:Envelope>